; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.auth_hdr = type <{ i8, i32, i32, i64, i32, i32, i64 }>

@cr_db_map = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 32, i32 250000, i32 0 }, section "maps", align 4, !dbg !0
@hashValues = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 500, i32 0 }, section "maps", align 4, !dbg !27
@crc32_table = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 256, i32 0 }, section "maps", align 4, !dbg !37
@__const.xdp_parsing.____fmt = private unnamed_addr constant [17 x i8] c"hash value - %d \00", align 1
@__const.xdp_parsing.____fmt.1 = private unnamed_addr constant [30 x i8] c"Unavibale map for hash values\00", align 1
@__const.xdp_parsing.____fmt.2 = private unnamed_addr constant [48 x i8] c"Unmatching Hash Values. Authentication Failure\0A\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !39
@__const.make_challenge_header.____fmt = private unnamed_addr constant [46 x i8] c"Msg type is 0, this is a auth request message\00", align 1
@__const.computeHash.____fmt = private unnamed_addr constant [21 x i8] c"No such key exist!!\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cr_db_map", scope: !2, file: !3, line: 49, type: !29, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/netx3/xdp_experiments/xdp-tutorial/xdp-puf", checksumkind: CSK_MD5, checksum: "a77d2e910e611047f96ef75a52cc80f1")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/xdp-puf", checksumkind: CSK_MD5, checksum: "db1ce4e5e29770657167bc8f57af9388")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !{!15, !16, !17, !20, !21, !23, !24, !19}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !18, line: 24, baseType: !19)
!18 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!19 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !18, line: 27, baseType: !7)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !37, !39, !44, !52, !57, !65, !72}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "hashValues", scope: !2, file: !3, line: 56, type: !29, isLocal: false, isDefinition: true)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !30, line: 33, size: 160, elements: !31)
!30 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/xdp-puf", checksumkind: CSK_MD5, checksum: "9e37b5f46a8fb7f5ed35ab69309bf15d")
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !29, file: !30, line: 34, baseType: !7, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !29, file: !30, line: 35, baseType: !7, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !29, file: !30, line: 36, baseType: !7, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !29, file: !30, line: 37, baseType: !7, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !29, file: !30, line: 38, baseType: !7, size: 32, offset: 128)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "crc32_table", scope: !2, file: !3, line: 65, type: !29, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 350, type: !41, isLocal: false, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 4)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !46, line: 89, type: !47, isLocal: true, isDefinition: true)
!46 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/xdp-puf", checksumkind: CSK_MD5, checksum: "2601bcf9d7985cb46bfbd904b60f5aaf")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !18, line: 31, baseType: !51)
!51 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "bpf_get_prandom_u32", scope: !2, file: !46, line: 168, type: !54, isLocal: true, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!20}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !46, line: 152, type: !59, isLocal: true, isDefinition: true)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !63, !20, null}
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !46, line: 55, type: !67, isLocal: true, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!62, !15, !70, !70, !50}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !46, line: 33, type: !74, isLocal: true, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!15, !15, !70}
!77 = !{i32 7, !"Dwarf Version", i32 5}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 1, !"wchar_size", i32 4}
!80 = !{i32 7, !"frame-pointer", i32 2}
!81 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!82 = distinct !DISubprogram(name: "xdp_parsing", scope: !3, file: !3, line: 196, type: !83, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !93)
!83 = !DISubroutineType(types: !84)
!84 = !{!62, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !87)
!87 = !{!88, !89, !90, !91, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !6, line: 2857, baseType: !20, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !86, file: !6, line: 2858, baseType: !20, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !86, file: !6, line: 2859, baseType: !20, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !86, file: !6, line: 2861, baseType: !20, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !86, file: !6, line: 2862, baseType: !20, size: 32, offset: 128)
!93 = !{!94, !95, !108, !138, !147, !148, !149, !172, !173, !174, !177, !178, !183, !184, !185, !188, !189, !191, !198, !201, !202}
!94 = !DILocalVariable(name: "ctx", arg: 1, scope: !82, file: !3, line: 196, type: !85)
!95 = !DILocalVariable(name: "eth", scope: !82, file: !3, line: 199, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !98, line: 168, size: 112, elements: !99)
!98 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!99 = !{!100, !104, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !97, file: !98, line: 169, baseType: !101, size: 48)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 48, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 6)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !97, file: !98, line: 170, baseType: !101, size: 48, offset: 48)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !97, file: !98, line: 171, baseType: !106, size: 16, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !107, line: 25, baseType: !17)
!107 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!108 = !DILocalVariable(name: "iph", scope: !82, file: !3, line: 200, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !111, line: 86, size: 160, elements: !112)
!111 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "4e88ed297bc3832dfa96a5c9b60cec92")
!112 = !{!113, !115, !116, !117, !118, !119, !120, !121, !122, !124}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !110, file: !111, line: 88, baseType: !114, size: 4, flags: DIFlagBitField, extraData: i64 0)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !18, line: 21, baseType: !25)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !110, file: !111, line: 89, baseType: !114, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !110, file: !111, line: 96, baseType: !114, size: 8, offset: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !110, file: !111, line: 97, baseType: !106, size: 16, offset: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !111, line: 98, baseType: !106, size: 16, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !110, file: !111, line: 99, baseType: !106, size: 16, offset: 48)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !110, file: !111, line: 100, baseType: !114, size: 8, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !110, file: !111, line: 101, baseType: !114, size: 8, offset: 72)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !110, file: !111, line: 102, baseType: !123, size: 16, offset: 80)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !107, line: 31, baseType: !17)
!124 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !111, line: 103, baseType: !125, size: 64, offset: 96)
!125 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !111, line: 103, size: 64, elements: !126)
!126 = !{!127, !133}
!127 = !DIDerivedType(tag: DW_TAG_member, scope: !125, file: !111, line: 103, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !125, file: !111, line: 103, size: 64, elements: !129)
!129 = !{!130, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !128, file: !111, line: 103, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !107, line: 27, baseType: !20)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !128, file: !111, line: 103, baseType: !131, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !125, file: !111, line: 103, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !125, file: !111, line: 103, size: 64, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !134, file: !111, line: 103, baseType: !131, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !134, file: !111, line: 103, baseType: !131, size: 32, offset: 32)
!138 = !DILocalVariable(name: "udph", scope: !82, file: !3, line: 201, type: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !141, line: 23, size: 64, elements: !142)
!141 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!142 = !{!143, !144, !145, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !140, file: !141, line: 24, baseType: !106, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !140, file: !141, line: 25, baseType: !106, size: 16, offset: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !141, line: 26, baseType: !106, size: 16, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !140, file: !141, line: 27, baseType: !123, size: 16, offset: 48)
!147 = !DILocalVariable(name: "data_end", scope: !82, file: !3, line: 203, type: !15)
!148 = !DILocalVariable(name: "data", scope: !82, file: !3, line: 204, type: !15)
!149 = !DILocalVariable(name: "payload", scope: !150, file: !3, line: 233, type: !154)
!150 = distinct !DILexicalBlock(scope: !151, file: !3, line: 226, column: 9)
!151 = distinct !DILexicalBlock(scope: !152, file: !3, line: 221, column: 13)
!152 = distinct !DILexicalBlock(scope: !153, file: !3, line: 207, column: 3)
!153 = distinct !DILexicalBlock(scope: !82, file: !3, line: 206, column: 6)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "auth_hdr", file: !3, line: 37, size: 264, elements: !156)
!156 = !{!157, !162, !165, !166, !169, !170, !171}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "msgType", scope: !155, file: !3, line: 38, baseType: !158, size: 8)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !159, line: 24, baseType: !160)
!159 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !161, line: 38, baseType: !25)
!161 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "challenge1", scope: !155, file: !3, line: 39, baseType: !163, size: 32, offset: 8)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !159, line: 26, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !161, line: 42, baseType: !7)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "challenge2", scope: !155, file: !3, line: 40, baseType: !163, size: 32, offset: 40)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "randomnumber", scope: !155, file: !3, line: 41, baseType: !167, size: 64, offset: 72)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !159, line: 27, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !161, line: 48, baseType: !51)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !155, file: !3, line: 42, baseType: !163, size: 32, offset: 136)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !155, file: !3, line: 43, baseType: !163, size: 32, offset: 168)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prTime", scope: !155, file: !3, line: 44, baseType: !167, size: 64, offset: 200)
!172 = !DILocalVariable(name: "msg_type", scope: !150, file: !3, line: 245, type: !158)
!173 = !DILocalVariable(name: "id", scope: !150, file: !3, line: 246, type: !163)
!174 = !DILocalVariable(name: "t1", scope: !175, file: !3, line: 252, type: !167)
!175 = distinct !DILexicalBlock(scope: !176, file: !3, line: 251, column: 12)
!176 = distinct !DILexicalBlock(scope: !150, file: !3, line: 250, column: 15)
!177 = !DILocalVariable(name: "h", scope: !175, file: !3, line: 253, type: !163)
!178 = !DILocalVariable(name: "____fmt", scope: !179, file: !3, line: 254, type: !180)
!179 = distinct !DILexicalBlock(scope: !175, file: !3, line: 254, column: 13)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 136, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 17)
!183 = !DILocalVariable(name: "src_port", scope: !175, file: !3, line: 269, type: !106)
!184 = !DILocalVariable(name: "t2", scope: !175, file: !3, line: 283, type: !167)
!185 = !DILocalVariable(name: "t1", scope: !186, file: !3, line: 291, type: !167)
!186 = distinct !DILexicalBlock(scope: !187, file: !3, line: 290, column: 12)
!187 = distinct !DILexicalBlock(scope: !176, file: !3, line: 289, column: 20)
!188 = !DILocalVariable(name: "h1", scope: !186, file: !3, line: 292, type: !163)
!189 = !DILocalVariable(name: "h2", scope: !186, file: !3, line: 293, type: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!191 = !DILocalVariable(name: "____fmt", scope: !192, file: !3, line: 297, type: !195)
!192 = distinct !DILexicalBlock(scope: !193, file: !3, line: 297, column: 14)
!193 = distinct !DILexicalBlock(scope: !194, file: !3, line: 296, column: 13)
!194 = distinct !DILexicalBlock(scope: !186, file: !3, line: 295, column: 16)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 240, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 30)
!198 = !DILocalVariable(name: "src_port", scope: !199, file: !3, line: 314, type: !106)
!199 = distinct !DILexicalBlock(scope: !200, file: !3, line: 303, column: 13)
!200 = distinct !DILexicalBlock(scope: !186, file: !3, line: 302, column: 16)
!201 = !DILocalVariable(name: "t2", scope: !199, file: !3, line: 326, type: !167)
!202 = !DILocalVariable(name: "____fmt", scope: !203, file: !3, line: 332, type: !205)
!203 = distinct !DILexicalBlock(scope: !204, file: !3, line: 332, column: 4)
!204 = distinct !DILexicalBlock(scope: !200, file: !3, line: 331, column: 3)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 384, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 48)
!208 = !DILocation(line: 0, scope: !82)
!209 = !DILocation(line: 203, column: 44, scope: !82)
!210 = !{!211, !212, i64 4}
!211 = !{!"xdp_md", !212, i64 0, !212, i64 4, !212, i64 8, !212, i64 12, !212, i64 16}
!212 = !{!"int", !213, i64 0}
!213 = !{!"omnipotent char", !214, i64 0}
!214 = !{!"Simple C/C++ TBAA"}
!215 = !DILocation(line: 203, column: 30, scope: !82)
!216 = !DILocation(line: 203, column: 21, scope: !82)
!217 = !DILocation(line: 204, column: 40, scope: !82)
!218 = !{!211, !212, i64 0}
!219 = !DILocation(line: 204, column: 26, scope: !82)
!220 = !DILocation(line: 204, column: 17, scope: !82)
!221 = !DILocation(line: 206, column: 11, scope: !153)
!222 = !DILocation(line: 206, column: 6, scope: !82)
!223 = !DILocation(line: 208, column: 15, scope: !152)
!224 = !DILocation(line: 209, column: 18, scope: !225)
!225 = distinct !DILexicalBlock(scope: !152, file: !3, line: 209, column: 13)
!226 = !DILocation(line: 209, column: 33, scope: !225)
!227 = !DILocation(line: 209, column: 13, scope: !152)
!228 = !DILocation(line: 212, column: 13, scope: !229)
!229 = distinct !DILexicalBlock(scope: !152, file: !3, line: 212, column: 13)
!230 = !{!231, !232, i64 12}
!231 = !{!"ethhdr", !213, i64 0, !213, i64 6, !232, i64 12}
!232 = !{!"short", !213, i64 0}
!233 = !DILocation(line: 212, column: 37, scope: !229)
!234 = !DILocation(line: 212, column: 13, scope: !152)
!235 = !DILocation(line: 218, column: 33, scope: !236)
!236 = distinct !DILexicalBlock(scope: !152, file: !3, line: 218, column: 13)
!237 = !DILocation(line: 218, column: 48, scope: !236)
!238 = !DILocation(line: 218, column: 13, scope: !152)
!239 = !DILocation(line: 221, column: 18, scope: !151)
!240 = !{!241, !213, i64 9}
!241 = !{!"iphdr", !213, i64 0, !213, i64 0, !213, i64 1, !232, i64 2, !232, i64 4, !232, i64 6, !213, i64 8, !213, i64 9, !232, i64 10, !213, i64 12}
!242 = !DILocation(line: 221, column: 27, scope: !151)
!243 = !DILocation(line: 221, column: 13, scope: !152)
!244 = !DILocation(line: 228, column: 51, scope: !245)
!245 = distinct !DILexicalBlock(scope: !150, file: !3, line: 228, column: 16)
!246 = !DILocation(line: 228, column: 67, scope: !245)
!247 = !DILocation(line: 228, column: 16, scope: !150)
!248 = !DILocation(line: 233, column: 39, scope: !150)
!249 = !DILocation(line: 0, scope: !150)
!250 = !DILocation(line: 235, column: 59, scope: !251)
!251 = distinct !DILexicalBlock(scope: !150, file: !3, line: 235, column: 8)
!252 = !DILocation(line: 235, column: 77, scope: !251)
!253 = !DILocation(line: 235, column: 8, scope: !150)
!254 = !DILocation(line: 245, column: 40, scope: !150)
!255 = !{!256, !213, i64 0}
!256 = !{!"auth_hdr", !213, i64 0, !212, i64 1, !212, i64 5, !257, i64 9, !212, i64 17, !212, i64 21, !257, i64 25}
!257 = !{!"long long", !213, i64 0}
!258 = !DILocation(line: 246, column: 12, scope: !150)
!259 = !DILocation(line: 246, column: 26, scope: !150)
!260 = !{!256, !212, i64 21}
!261 = !DILocation(line: 246, column: 56, scope: !150)
!262 = !DILocation(line: 246, column: 21, scope: !150)
!263 = !{!212, !212, i64 0}
!264 = !DILocation(line: 250, column: 15, scope: !150)
!265 = !DILocation(line: 252, column: 17, scope: !175)
!266 = !DILocation(line: 0, scope: !175)
!267 = !DILocation(line: 253, column: 13, scope: !175)
!268 = !DILocation(line: 253, column: 26, scope: !175)
!269 = !DILocation(line: 253, column: 22, scope: !175)
!270 = !DILocation(line: 254, column: 13, scope: !179)
!271 = !DILocation(line: 254, column: 13, scope: !175)
!272 = !DILocation(line: 255, column: 8, scope: !273)
!273 = distinct !DILexicalBlock(scope: !175, file: !3, line: 255, column: 6)
!274 = !DILocation(line: 255, column: 6, scope: !175)
!275 = !DILocation(line: 259, column: 14, scope: !276)
!276 = distinct !DILexicalBlock(scope: !273, file: !3, line: 258, column: 13)
!277 = !DILocalVariable(name: "iphdr", arg: 1, scope: !278, file: !279, line: 136, type: !109)
!278 = distinct !DISubprogram(name: "swap_src_dst_ipv4", scope: !279, file: !279, line: 136, type: !280, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !282)
!279 = !DIFile(filename: "./../common/rewrite_helpers.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/xdp-puf", checksumkind: CSK_MD5, checksum: "75040841dc53cbf2ffc17c0802a4440a")
!280 = !DISubroutineType(types: !281)
!281 = !{null, !109}
!282 = !{!277, !283}
!283 = !DILocalVariable(name: "tmp", scope: !278, file: !279, line: 138, type: !131)
!284 = !DILocation(line: 0, scope: !278, inlinedAt: !285)
!285 = distinct !DILocation(line: 265, column: 7, scope: !175)
!286 = !DILocation(line: 138, column: 22, scope: !278, inlinedAt: !285)
!287 = !{!213, !213, i64 0}
!288 = !DILocation(line: 140, column: 24, scope: !278, inlinedAt: !285)
!289 = !DILocation(line: 140, column: 15, scope: !278, inlinedAt: !285)
!290 = !DILocation(line: 141, column: 15, scope: !278, inlinedAt: !285)
!291 = !DILocalVariable(name: "eth", arg: 1, scope: !292, file: !279, line: 113, type: !96)
!292 = distinct !DISubprogram(name: "swap_src_dst_mac", scope: !279, file: !279, line: 113, type: !293, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !96}
!295 = !{!291, !296}
!296 = !DILocalVariable(name: "h_tmp", scope: !292, file: !279, line: 115, type: !297)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 48, elements: !102)
!298 = !DILocation(line: 0, scope: !292, inlinedAt: !299)
!299 = distinct !DILocation(line: 267, column: 7, scope: !175)
!300 = !DILocation(line: 115, column: 2, scope: !292, inlinedAt: !299)
!301 = !DILocation(line: 115, column: 7, scope: !292, inlinedAt: !299)
!302 = !DILocation(line: 117, column: 2, scope: !292, inlinedAt: !299)
!303 = !DILocation(line: 118, column: 2, scope: !292, inlinedAt: !299)
!304 = !DILocation(line: 119, column: 2, scope: !292, inlinedAt: !299)
!305 = !DILocation(line: 120, column: 1, scope: !292, inlinedAt: !299)
!306 = !DILocation(line: 269, column: 31, scope: !175)
!307 = !{!308, !232, i64 0}
!308 = !{!"udphdr", !232, i64 0, !232, i64 2, !232, i64 4, !232, i64 6}
!309 = !DILocation(line: 270, column: 28, scope: !175)
!310 = !{!308, !232, i64 2}
!311 = !DILocation(line: 270, column: 20, scope: !175)
!312 = !DILocation(line: 271, column: 18, scope: !175)
!313 = !DILocation(line: 276, column: 13, scope: !175)
!314 = !DILocation(line: 276, column: 19, scope: !175)
!315 = !{!308, !232, i64 6}
!316 = !DILocation(line: 279, column: 12, scope: !175)
!317 = !DILocation(line: 279, column: 18, scope: !175)
!318 = !{!241, !232, i64 10}
!319 = !DILocation(line: 280, column: 20, scope: !175)
!320 = !DILocation(line: 280, column: 18, scope: !175)
!321 = !DILocation(line: 283, column: 17, scope: !175)
!322 = !DILocation(line: 284, column: 20, scope: !175)
!323 = !DILocation(line: 284, column: 12, scope: !175)
!324 = !DILocation(line: 284, column: 18, scope: !175)
!325 = !{!256, !257, i64 25}
!326 = !DILocation(line: 287, column: 12, scope: !176)
!327 = !DILocation(line: 291, column: 17, scope: !186)
!328 = !DILocation(line: 0, scope: !186)
!329 = !DILocation(line: 292, column: 27, scope: !186)
!330 = !{!256, !212, i64 17}
!331 = !DILocation(line: 293, column: 28, scope: !186)
!332 = !DILocation(line: 295, column: 17, scope: !194)
!333 = !DILocation(line: 295, column: 16, scope: !186)
!334 = !DILocation(line: 297, column: 14, scope: !192)
!335 = !DILocation(line: 297, column: 14, scope: !193)
!336 = !DILocation(line: 298, column: 14, scope: !193)
!337 = !DILocation(line: 302, column: 22, scope: !200)
!338 = !DILocation(line: 302, column: 19, scope: !200)
!339 = !DILocation(line: 302, column: 16, scope: !186)
!340 = !DILocation(line: 304, column: 31, scope: !199)
!341 = !DILocation(line: 305, column: 36, scope: !199)
!342 = !DILocation(line: 305, column: 34, scope: !199)
!343 = !DILocation(line: 0, scope: !278, inlinedAt: !344)
!344 = distinct !DILocation(line: 310, column: 8, scope: !199)
!345 = !DILocation(line: 138, column: 22, scope: !278, inlinedAt: !344)
!346 = !DILocation(line: 140, column: 24, scope: !278, inlinedAt: !344)
!347 = !DILocation(line: 140, column: 15, scope: !278, inlinedAt: !344)
!348 = !DILocation(line: 141, column: 15, scope: !278, inlinedAt: !344)
!349 = !DILocation(line: 0, scope: !292, inlinedAt: !350)
!350 = distinct !DILocation(line: 312, column: 8, scope: !199)
!351 = !DILocation(line: 115, column: 2, scope: !292, inlinedAt: !350)
!352 = !DILocation(line: 115, column: 7, scope: !292, inlinedAt: !350)
!353 = !DILocation(line: 117, column: 2, scope: !292, inlinedAt: !350)
!354 = !DILocation(line: 118, column: 2, scope: !292, inlinedAt: !350)
!355 = !DILocation(line: 119, column: 2, scope: !292, inlinedAt: !350)
!356 = !DILocation(line: 120, column: 1, scope: !292, inlinedAt: !350)
!357 = !DILocation(line: 314, column: 32, scope: !199)
!358 = !DILocation(line: 0, scope: !199)
!359 = !DILocation(line: 315, column: 29, scope: !199)
!360 = !DILocation(line: 315, column: 21, scope: !199)
!361 = !DILocation(line: 316, column: 19, scope: !199)
!362 = !DILocation(line: 320, column: 14, scope: !199)
!363 = !DILocation(line: 320, column: 20, scope: !199)
!364 = !DILocation(line: 323, column: 13, scope: !199)
!365 = !DILocation(line: 323, column: 19, scope: !199)
!366 = !DILocation(line: 324, column: 21, scope: !199)
!367 = !DILocation(line: 324, column: 19, scope: !199)
!368 = !DILocation(line: 326, column: 22, scope: !199)
!369 = !DILocation(line: 327, column: 21, scope: !199)
!370 = !DILocation(line: 327, column: 13, scope: !199)
!371 = !DILocation(line: 327, column: 19, scope: !199)
!372 = !DILocation(line: 338, column: 9, scope: !151)
!373 = !DILocation(line: 332, column: 4, scope: !203)
!374 = !DILocation(line: 332, column: 4, scope: !204)
!375 = !DILocation(line: 347, column: 3, scope: !82)
!376 = !DILocation(line: 349, column: 1, scope: !82)
!377 = distinct !DISubprogram(name: "make_challenge_header", scope: !3, file: !3, line: 109, type: !378, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !380)
!378 = !DISubroutineType(types: !379)
!379 = !{!163, !154}
!380 = !{!381, !382, !387, !388, !397, !398, !399, !400, !407, !408, !409, !410, !411, !412, !416}
!381 = !DILocalVariable(name: "payload", arg: 1, scope: !377, file: !3, line: 109, type: !154)
!382 = !DILocalVariable(name: "____fmt", scope: !383, file: !3, line: 111, type: !384)
!383 = distinct !DILexicalBlock(scope: !377, file: !3, line: 111, column: 2)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 368, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 46)
!387 = !DILocalVariable(name: "id", scope: !377, file: !3, line: 113, type: !163)
!388 = !DILocalVariable(name: "rec", scope: !377, file: !3, line: 115, type: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crPair", file: !391, line: 13, size: 256, elements: !392)
!391 = !DIFile(filename: "./common_kern_user.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/xdp-puf", checksumkind: CSK_MD5, checksum: "cf181cfa91b808d00c3d46c58e57846f")
!392 = !{!393, !394, !395, !396}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ch1", scope: !390, file: !391, line: 14, baseType: !163, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "resp1", scope: !390, file: !391, line: 15, baseType: !167, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ch2", scope: !390, file: !391, line: 16, baseType: !163, size: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "resp2", scope: !390, file: !391, line: 17, baseType: !167, size: 64, offset: 192)
!397 = !DILocalVariable(name: "RN", scope: !377, file: !3, line: 117, type: !167)
!398 = !DILocalVariable(name: "i", scope: !377, file: !3, line: 119, type: !20)
!399 = !DILocalVariable(name: "key", scope: !377, file: !3, line: 121, type: !20)
!400 = !DILocalVariable(name: "____fmt", scope: !401, file: !3, line: 127, type: !404)
!401 = distinct !DILexicalBlock(scope: !402, file: !3, line: 127, column: 10)
!402 = distinct !DILexicalBlock(scope: !403, file: !3, line: 126, column: 9)
!403 = distinct !DILexicalBlock(scope: !377, file: !3, line: 125, column: 13)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 168, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 21)
!407 = !DILocalVariable(name: "c1", scope: !377, file: !3, line: 131, type: !163)
!408 = !DILocalVariable(name: "c2", scope: !377, file: !3, line: 132, type: !163)
!409 = !DILocalVariable(name: "r1", scope: !377, file: !3, line: 133, type: !167)
!410 = !DILocalVariable(name: "r2", scope: !377, file: !3, line: 134, type: !167)
!411 = !DILocalVariable(name: "RN1", scope: !377, file: !3, line: 138, type: !167)
!412 = !DILocalVariable(name: "input_ints", scope: !377, file: !3, line: 148, type: !413)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 192, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 3)
!416 = !DILocalVariable(name: "hash", scope: !377, file: !3, line: 155, type: !163)
!417 = !DILocation(line: 83, column: 5, scope: !418, inlinedAt: !445)
!418 = distinct !DISubprogram(name: "computeHash", scope: !3, file: !3, line: 73, type: !419, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !422)
!419 = !DISubroutineType(types: !420)
!420 = !{!20, !421, !20}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!422 = !{!423, !424, !425, !427, !431, !433, !434, !436, !439, !441}
!423 = !DILocalVariable(name: "input_ints", arg: 1, scope: !418, file: !3, line: 73, type: !421)
!424 = !DILocalVariable(name: "num_ints", arg: 2, scope: !418, file: !3, line: 73, type: !20)
!425 = !DILocalVariable(name: "__vla_expr0", scope: !418, type: !426, flags: DIFlagArtificial)
!426 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!427 = !DILocalVariable(name: "buffer", scope: !418, file: !3, line: 83, type: !428)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: !425)
!431 = !DILocalVariable(name: "i", scope: !432, file: !3, line: 84, type: !20)
!432 = distinct !DILexicalBlock(scope: !418, file: !3, line: 84, column: 5)
!433 = !DILocalVariable(name: "crc", scope: !418, file: !3, line: 89, type: !20)
!434 = !DILocalVariable(name: "i", scope: !435, file: !3, line: 90, type: !20)
!435 = distinct !DILexicalBlock(scope: !418, file: !3, line: 90, column: 5)
!436 = !DILocalVariable(name: "index", scope: !437, file: !3, line: 92, type: !20)
!437 = distinct !DILexicalBlock(scope: !438, file: !3, line: 90, column: 48)
!438 = distinct !DILexicalBlock(scope: !435, file: !3, line: 90, column: 5)
!439 = !DILocalVariable(name: "rec", scope: !437, file: !3, line: 93, type: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!441 = !DILocalVariable(name: "____fmt", scope: !442, file: !3, line: 97, type: !404)
!442 = distinct !DILexicalBlock(scope: !443, file: !3, line: 97, column: 17)
!443 = distinct !DILexicalBlock(scope: !444, file: !3, line: 96, column: 9)
!444 = distinct !DILexicalBlock(scope: !437, file: !3, line: 95, column: 13)
!445 = distinct !DILocation(line: 155, column: 18, scope: !377)
!446 = !DILocation(line: 0, scope: !377)
!447 = !DILocation(line: 111, column: 2, scope: !383)
!448 = !DILocation(line: 111, column: 2, scope: !377)
