; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.auth_hdr = type <{ i8, i32, i32, i64, i64, i64, i64, i32, i32, i64 }>

@cr_db_map = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 80, i32 250000, i32 0 }, section "maps", align 4, !dbg !0
@hashValues = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 500, i32 0 }, section "maps", align 4, !dbg !27
@crc32_table = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 256, i32 0 }, section "maps", align 4, !dbg !37
@__const.xdp_parsing.____fmt = private unnamed_addr constant [17 x i8] c"hash value - %d \00", align 1
@__const.xdp_parsing.____fmt.1 = private unnamed_addr constant [30 x i8] c"Unavibale map for hash values\00", align 1
@__const.xdp_parsing.____fmt.2 = private unnamed_addr constant [48 x i8] c"Unmatching Hash Values. Authentication Failure\0A\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !39
@__const.make_challenge_header.____fmt = private unnamed_addr constant [46 x i8] c"Msg type is 0, this is a auth request message\00", align 1
@__const.computeHash.____fmt = private unnamed_addr constant [21 x i8] c"No such key exist!!\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cr_db_map", scope: !2, file: !3, line: 51, type: !29, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_256", checksumkind: CSK_MD5, checksum: "67f8f5a675feaa63bbce193eb389394e")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_256", checksumkind: CSK_MD5, checksum: "db1ce4e5e29770657167bc8f57af9388")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !{!15, !16, !17, !20, !21, !23, !24, !19}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !18, line: 24, baseType: !19)
!18 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!19 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !18, line: 27, baseType: !7)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !37, !39, !44, !52, !57, !65, !72}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "hashValues", scope: !2, file: !3, line: 58, type: !29, isLocal: false, isDefinition: true)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !30, line: 33, size: 160, elements: !31)
!30 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_256", checksumkind: CSK_MD5, checksum: "9e37b5f46a8fb7f5ed35ab69309bf15d")
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !29, file: !30, line: 34, baseType: !7, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !29, file: !30, line: 35, baseType: !7, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !29, file: !30, line: 36, baseType: !7, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !29, file: !30, line: 37, baseType: !7, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !29, file: !30, line: 38, baseType: !7, size: 32, offset: 128)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "crc32_table", scope: !2, file: !3, line: 67, type: !29, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 381, type: !41, isLocal: false, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 4)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !46, line: 89, type: !47, isLocal: true, isDefinition: true)
!46 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_256", checksumkind: CSK_MD5, checksum: "2601bcf9d7985cb46bfbd904b60f5aaf")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !18, line: 31, baseType: !51)
!51 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "bpf_get_prandom_u32", scope: !2, file: !46, line: 168, type: !54, isLocal: true, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!20}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !46, line: 152, type: !59, isLocal: true, isDefinition: true)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !63, !20, null}
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !46, line: 55, type: !67, isLocal: true, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!62, !15, !70, !70, !50}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !46, line: 33, type: !74, isLocal: true, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!15, !15, !70}
!77 = !{i32 7, !"Dwarf Version", i32 5}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 1, !"wchar_size", i32 4}
!80 = !{i32 7, !"frame-pointer", i32 2}
!81 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!82 = distinct !DISubprogram(name: "xdp_parsing", scope: !3, file: !3, line: 226, type: !83, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !93)
!83 = !DISubroutineType(types: !84)
!84 = !{!62, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !87)
!87 = !{!88, !89, !90, !91, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !6, line: 2857, baseType: !20, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !86, file: !6, line: 2858, baseType: !20, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !86, file: !6, line: 2859, baseType: !20, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !86, file: !6, line: 2861, baseType: !20, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !86, file: !6, line: 2862, baseType: !20, size: 32, offset: 128)
!93 = !{!94, !95, !108, !138, !147, !148, !149, !175, !176, !177, !180, !181, !186, !187, !188, !191, !192, !194, !201, !204, !205}
!94 = !DILocalVariable(name: "ctx", arg: 1, scope: !82, file: !3, line: 226, type: !85)
!95 = !DILocalVariable(name: "eth", scope: !82, file: !3, line: 229, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !98, line: 168, size: 112, elements: !99)
!98 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!99 = !{!100, !104, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !97, file: !98, line: 169, baseType: !101, size: 48)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 48, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 6)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !97, file: !98, line: 170, baseType: !101, size: 48, offset: 48)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !97, file: !98, line: 171, baseType: !106, size: 16, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !107, line: 25, baseType: !17)
!107 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!108 = !DILocalVariable(name: "iph", scope: !82, file: !3, line: 230, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !111, line: 86, size: 160, elements: !112)
!111 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "4e88ed297bc3832dfa96a5c9b60cec92")
!112 = !{!113, !115, !116, !117, !118, !119, !120, !121, !122, !124}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !110, file: !111, line: 88, baseType: !114, size: 4, flags: DIFlagBitField, extraData: i64 0)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !18, line: 21, baseType: !25)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !110, file: !111, line: 89, baseType: !114, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !110, file: !111, line: 96, baseType: !114, size: 8, offset: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !110, file: !111, line: 97, baseType: !106, size: 16, offset: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !111, line: 98, baseType: !106, size: 16, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !110, file: !111, line: 99, baseType: !106, size: 16, offset: 48)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !110, file: !111, line: 100, baseType: !114, size: 8, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !110, file: !111, line: 101, baseType: !114, size: 8, offset: 72)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !110, file: !111, line: 102, baseType: !123, size: 16, offset: 80)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !107, line: 31, baseType: !17)
!124 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !111, line: 103, baseType: !125, size: 64, offset: 96)
!125 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !111, line: 103, size: 64, elements: !126)
!126 = !{!127, !133}
!127 = !DIDerivedType(tag: DW_TAG_member, scope: !125, file: !111, line: 103, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !125, file: !111, line: 103, size: 64, elements: !129)
!129 = !{!130, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !128, file: !111, line: 103, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !107, line: 27, baseType: !20)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !128, file: !111, line: 103, baseType: !131, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !125, file: !111, line: 103, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !125, file: !111, line: 103, size: 64, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !134, file: !111, line: 103, baseType: !131, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !134, file: !111, line: 103, baseType: !131, size: 32, offset: 32)
!138 = !DILocalVariable(name: "udph", scope: !82, file: !3, line: 231, type: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !141, line: 23, size: 64, elements: !142)
!141 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!142 = !{!143, !144, !145, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !140, file: !141, line: 24, baseType: !106, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !140, file: !141, line: 25, baseType: !106, size: 16, offset: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !141, line: 26, baseType: !106, size: 16, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !140, file: !141, line: 27, baseType: !123, size: 16, offset: 48)
!147 = !DILocalVariable(name: "data_end", scope: !82, file: !3, line: 233, type: !15)
!148 = !DILocalVariable(name: "data", scope: !82, file: !3, line: 234, type: !15)
!149 = !DILocalVariable(name: "payload", scope: !150, file: !3, line: 263, type: !154)
!150 = distinct !DILexicalBlock(scope: !151, file: !3, line: 256, column: 9)
!151 = distinct !DILexicalBlock(scope: !152, file: !3, line: 251, column: 13)
!152 = distinct !DILexicalBlock(scope: !153, file: !3, line: 237, column: 3)
!153 = distinct !DILexicalBlock(scope: !82, file: !3, line: 236, column: 6)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "auth_hdr", file: !3, line: 36, size: 456, elements: !156)
!156 = !{!157, !162, !165, !166, !169, !170, !171, !172, !173, !174}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "msgType", scope: !155, file: !3, line: 37, baseType: !158, size: 8)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !159, line: 24, baseType: !160)
!159 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !161, line: 38, baseType: !25)
!161 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "challenge1", scope: !155, file: !3, line: 38, baseType: !163, size: 32, offset: 8)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !159, line: 26, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !161, line: 42, baseType: !7)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "challenge2", scope: !155, file: !3, line: 39, baseType: !163, size: 32, offset: 40)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "randomnumber1", scope: !155, file: !3, line: 40, baseType: !167, size: 64, offset: 72)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !159, line: 27, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !161, line: 48, baseType: !51)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "randomnumber2", scope: !155, file: !3, line: 41, baseType: !167, size: 64, offset: 136)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "randomnumber3", scope: !155, file: !3, line: 42, baseType: !167, size: 64, offset: 200)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "randomnumber4", scope: !155, file: !3, line: 43, baseType: !167, size: 64, offset: 264)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !155, file: !3, line: 44, baseType: !163, size: 32, offset: 328)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !155, file: !3, line: 45, baseType: !163, size: 32, offset: 360)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prTime", scope: !155, file: !3, line: 46, baseType: !167, size: 64, offset: 392)
!175 = !DILocalVariable(name: "msg_type", scope: !150, file: !3, line: 275, type: !158)
!176 = !DILocalVariable(name: "id", scope: !150, file: !3, line: 276, type: !163)
!177 = !DILocalVariable(name: "t1", scope: !178, file: !3, line: 282, type: !167)
!178 = distinct !DILexicalBlock(scope: !179, file: !3, line: 281, column: 12)
!179 = distinct !DILexicalBlock(scope: !150, file: !3, line: 280, column: 15)
!180 = !DILocalVariable(name: "h", scope: !178, file: !3, line: 284, type: !163)
!181 = !DILocalVariable(name: "____fmt", scope: !182, file: !3, line: 285, type: !183)
!182 = distinct !DILexicalBlock(scope: !178, file: !3, line: 285, column: 13)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 136, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 17)
!186 = !DILocalVariable(name: "src_port", scope: !178, file: !3, line: 300, type: !106)
!187 = !DILocalVariable(name: "t2", scope: !178, file: !3, line: 313, type: !167)
!188 = !DILocalVariable(name: "t1", scope: !189, file: !3, line: 321, type: !167)
!189 = distinct !DILexicalBlock(scope: !190, file: !3, line: 320, column: 12)
!190 = distinct !DILexicalBlock(scope: !179, file: !3, line: 319, column: 20)
!191 = !DILocalVariable(name: "h1", scope: !189, file: !3, line: 322, type: !163)
!192 = !DILocalVariable(name: "h2", scope: !189, file: !3, line: 323, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!194 = !DILocalVariable(name: "____fmt", scope: !195, file: !3, line: 327, type: !198)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 327, column: 14)
!196 = distinct !DILexicalBlock(scope: !197, file: !3, line: 326, column: 13)
!197 = distinct !DILexicalBlock(scope: !189, file: !3, line: 325, column: 16)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 240, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 30)
!201 = !DILocalVariable(name: "src_port", scope: !202, file: !3, line: 344, type: !106)
!202 = distinct !DILexicalBlock(scope: !203, file: !3, line: 333, column: 13)
!203 = distinct !DILexicalBlock(scope: !189, file: !3, line: 332, column: 16)
!204 = !DILocalVariable(name: "t2", scope: !202, file: !3, line: 356, type: !167)
!205 = !DILocalVariable(name: "____fmt", scope: !206, file: !3, line: 363, type: !208)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 363, column: 4)
!207 = distinct !DILexicalBlock(scope: !203, file: !3, line: 362, column: 3)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 384, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 48)
!211 = !DILocation(line: 0, scope: !82)
!212 = !DILocation(line: 233, column: 44, scope: !82)
!213 = !{!214, !215, i64 4}
!214 = !{!"xdp_md", !215, i64 0, !215, i64 4, !215, i64 8, !215, i64 12, !215, i64 16}
!215 = !{!"int", !216, i64 0}
!216 = !{!"omnipotent char", !217, i64 0}
!217 = !{!"Simple C/C++ TBAA"}
!218 = !DILocation(line: 233, column: 30, scope: !82)
!219 = !DILocation(line: 233, column: 21, scope: !82)
!220 = !DILocation(line: 234, column: 40, scope: !82)
!221 = !{!214, !215, i64 0}
!222 = !DILocation(line: 234, column: 26, scope: !82)
!223 = !DILocation(line: 234, column: 17, scope: !82)
!224 = !DILocation(line: 236, column: 11, scope: !153)
!225 = !DILocation(line: 236, column: 6, scope: !82)
!226 = !DILocation(line: 238, column: 15, scope: !152)
!227 = !DILocation(line: 239, column: 18, scope: !228)
!228 = distinct !DILexicalBlock(scope: !152, file: !3, line: 239, column: 13)
!229 = !DILocation(line: 239, column: 33, scope: !228)
!230 = !DILocation(line: 239, column: 13, scope: !152)
!231 = !DILocation(line: 242, column: 13, scope: !232)
!232 = distinct !DILexicalBlock(scope: !152, file: !3, line: 242, column: 13)
!233 = !{!234, !235, i64 12}
!234 = !{!"ethhdr", !216, i64 0, !216, i64 6, !235, i64 12}
!235 = !{!"short", !216, i64 0}
!236 = !DILocation(line: 242, column: 37, scope: !232)
!237 = !DILocation(line: 242, column: 13, scope: !152)
!238 = !DILocation(line: 248, column: 33, scope: !239)
!239 = distinct !DILexicalBlock(scope: !152, file: !3, line: 248, column: 13)
!240 = !DILocation(line: 248, column: 48, scope: !239)
!241 = !DILocation(line: 248, column: 13, scope: !152)
!242 = !DILocation(line: 251, column: 18, scope: !151)
!243 = !{!244, !216, i64 9}
!244 = !{!"iphdr", !216, i64 0, !216, i64 0, !216, i64 1, !235, i64 2, !235, i64 4, !235, i64 6, !216, i64 8, !216, i64 9, !235, i64 10, !216, i64 12}
!245 = !DILocation(line: 251, column: 27, scope: !151)
!246 = !DILocation(line: 251, column: 13, scope: !152)
!247 = !DILocation(line: 258, column: 51, scope: !248)
!248 = distinct !DILexicalBlock(scope: !150, file: !3, line: 258, column: 16)
!249 = !DILocation(line: 258, column: 67, scope: !248)
!250 = !DILocation(line: 258, column: 16, scope: !150)
!251 = !DILocation(line: 263, column: 39, scope: !150)
!252 = !DILocation(line: 0, scope: !150)
!253 = !DILocation(line: 265, column: 59, scope: !254)
!254 = distinct !DILexicalBlock(scope: !150, file: !3, line: 265, column: 8)
!255 = !DILocation(line: 265, column: 77, scope: !254)
!256 = !DILocation(line: 265, column: 8, scope: !150)
!257 = !DILocation(line: 275, column: 40, scope: !150)
!258 = !{!259, !216, i64 0}
!259 = !{!"auth_hdr", !216, i64 0, !215, i64 1, !215, i64 5, !260, i64 9, !260, i64 17, !260, i64 25, !260, i64 33, !215, i64 41, !215, i64 45, !260, i64 49}
!260 = !{!"long long", !216, i64 0}
!261 = !DILocation(line: 276, column: 12, scope: !150)
!262 = !DILocation(line: 276, column: 26, scope: !150)
!263 = !{!259, !215, i64 45}
!264 = !DILocation(line: 276, column: 56, scope: !150)
!265 = !DILocation(line: 276, column: 21, scope: !150)
!266 = !{!215, !215, i64 0}
!267 = !DILocation(line: 280, column: 15, scope: !150)
!268 = !DILocation(line: 282, column: 17, scope: !178)
!269 = !DILocation(line: 0, scope: !178)
!270 = !DILocation(line: 284, column: 3, scope: !178)
!271 = !DILocation(line: 284, column: 16, scope: !178)
!272 = !DILocation(line: 284, column: 12, scope: !178)
!273 = !DILocation(line: 285, column: 13, scope: !182)
!274 = !DILocation(line: 285, column: 13, scope: !178)
!275 = !DILocation(line: 286, column: 8, scope: !276)
!276 = distinct !DILexicalBlock(scope: !178, file: !3, line: 286, column: 6)
!277 = !DILocation(line: 286, column: 6, scope: !178)
!278 = !DILocation(line: 290, column: 14, scope: !279)
!279 = distinct !DILexicalBlock(scope: !276, file: !3, line: 289, column: 13)
!280 = !DILocalVariable(name: "iphdr", arg: 1, scope: !281, file: !282, line: 136, type: !109)
!281 = distinct !DISubprogram(name: "swap_src_dst_ipv4", scope: !282, file: !282, line: 136, type: !283, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !285)
!282 = !DIFile(filename: "./../common/rewrite_helpers.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_256", checksumkind: CSK_MD5, checksum: "75040841dc53cbf2ffc17c0802a4440a")
!283 = !DISubroutineType(types: !284)
!284 = !{null, !109}
!285 = !{!280, !286}
!286 = !DILocalVariable(name: "tmp", scope: !281, file: !282, line: 138, type: !131)
!287 = !DILocation(line: 0, scope: !281, inlinedAt: !288)
!288 = distinct !DILocation(line: 296, column: 7, scope: !178)
!289 = !DILocation(line: 138, column: 22, scope: !281, inlinedAt: !288)
!290 = !{!216, !216, i64 0}
!291 = !DILocation(line: 140, column: 24, scope: !281, inlinedAt: !288)
!292 = !DILocation(line: 140, column: 15, scope: !281, inlinedAt: !288)
!293 = !DILocation(line: 141, column: 15, scope: !281, inlinedAt: !288)
!294 = !DILocalVariable(name: "eth", arg: 1, scope: !295, file: !282, line: 113, type: !96)
!295 = distinct !DISubprogram(name: "swap_src_dst_mac", scope: !282, file: !282, line: 113, type: !296, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !298)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !96}
!298 = !{!294, !299}
!299 = !DILocalVariable(name: "h_tmp", scope: !295, file: !282, line: 115, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 48, elements: !102)
!301 = !DILocation(line: 0, scope: !295, inlinedAt: !302)
!302 = distinct !DILocation(line: 298, column: 7, scope: !178)
!303 = !DILocation(line: 115, column: 2, scope: !295, inlinedAt: !302)
!304 = !DILocation(line: 115, column: 7, scope: !295, inlinedAt: !302)
!305 = !DILocation(line: 117, column: 2, scope: !295, inlinedAt: !302)
!306 = !DILocation(line: 118, column: 2, scope: !295, inlinedAt: !302)
!307 = !DILocation(line: 119, column: 2, scope: !295, inlinedAt: !302)
!308 = !DILocation(line: 120, column: 1, scope: !295, inlinedAt: !302)
!309 = !DILocation(line: 300, column: 31, scope: !178)
!310 = !{!311, !235, i64 0}
!311 = !{!"udphdr", !235, i64 0, !235, i64 2, !235, i64 4, !235, i64 6}
!312 = !DILocation(line: 301, column: 28, scope: !178)
!313 = !{!311, !235, i64 2}
!314 = !DILocation(line: 301, column: 20, scope: !178)
!315 = !DILocation(line: 302, column: 18, scope: !178)
!316 = !DILocation(line: 307, column: 13, scope: !178)
!317 = !DILocation(line: 307, column: 19, scope: !178)
!318 = !{!311, !235, i64 6}
!319 = !DILocation(line: 310, column: 12, scope: !178)
!320 = !DILocation(line: 310, column: 18, scope: !178)
!321 = !{!244, !235, i64 10}
!322 = !DILocation(line: 311, column: 20, scope: !178)
!323 = !DILocation(line: 311, column: 18, scope: !178)
!324 = !DILocation(line: 313, column: 17, scope: !178)
!325 = !DILocation(line: 314, column: 20, scope: !178)
!326 = !DILocation(line: 314, column: 12, scope: !178)
!327 = !DILocation(line: 314, column: 18, scope: !178)
!328 = !{!259, !260, i64 49}
!329 = !DILocation(line: 317, column: 12, scope: !179)
!330 = !DILocation(line: 321, column: 17, scope: !189)
!331 = !DILocation(line: 0, scope: !189)
!332 = !DILocation(line: 322, column: 27, scope: !189)
!333 = !{!259, !215, i64 41}
!334 = !DILocation(line: 323, column: 28, scope: !189)
!335 = !DILocation(line: 325, column: 17, scope: !197)
!336 = !DILocation(line: 325, column: 16, scope: !189)
!337 = !DILocation(line: 327, column: 14, scope: !195)
!338 = !DILocation(line: 327, column: 14, scope: !196)
!339 = !DILocation(line: 328, column: 14, scope: !196)
!340 = !DILocation(line: 332, column: 22, scope: !203)
!341 = !DILocation(line: 332, column: 19, scope: !203)
!342 = !DILocation(line: 332, column: 16, scope: !189)
!343 = !DILocation(line: 334, column: 31, scope: !202)
!344 = !DILocation(line: 335, column: 36, scope: !202)
!345 = !DILocation(line: 335, column: 34, scope: !202)
!346 = !DILocation(line: 0, scope: !281, inlinedAt: !347)
!347 = distinct !DILocation(line: 340, column: 8, scope: !202)
!348 = !DILocation(line: 138, column: 22, scope: !281, inlinedAt: !347)
!349 = !DILocation(line: 140, column: 24, scope: !281, inlinedAt: !347)
!350 = !DILocation(line: 140, column: 15, scope: !281, inlinedAt: !347)
!351 = !DILocation(line: 141, column: 15, scope: !281, inlinedAt: !347)
!352 = !DILocation(line: 0, scope: !295, inlinedAt: !353)
!353 = distinct !DILocation(line: 342, column: 8, scope: !202)
!354 = !DILocation(line: 115, column: 2, scope: !295, inlinedAt: !353)
!355 = !DILocation(line: 115, column: 7, scope: !295, inlinedAt: !353)
!356 = !DILocation(line: 117, column: 2, scope: !295, inlinedAt: !353)
!357 = !DILocation(line: 118, column: 2, scope: !295, inlinedAt: !353)
!358 = !DILocation(line: 119, column: 2, scope: !295, inlinedAt: !353)
!359 = !DILocation(line: 120, column: 1, scope: !295, inlinedAt: !353)
!360 = !DILocation(line: 344, column: 32, scope: !202)
!361 = !DILocation(line: 0, scope: !202)
!362 = !DILocation(line: 345, column: 29, scope: !202)
!363 = !DILocation(line: 345, column: 21, scope: !202)
!364 = !DILocation(line: 346, column: 19, scope: !202)
!365 = !DILocation(line: 350, column: 14, scope: !202)
!366 = !DILocation(line: 350, column: 20, scope: !202)
!367 = !DILocation(line: 353, column: 13, scope: !202)
!368 = !DILocation(line: 353, column: 19, scope: !202)
!369 = !DILocation(line: 354, column: 21, scope: !202)
!370 = !DILocation(line: 354, column: 19, scope: !202)
!371 = !DILocation(line: 356, column: 18, scope: !202)
!372 = !DILocation(line: 357, column: 21, scope: !202)
!373 = !DILocation(line: 357, column: 13, scope: !202)
!374 = !DILocation(line: 357, column: 19, scope: !202)
!375 = !DILocation(line: 369, column: 9, scope: !151)
!376 = !DILocation(line: 363, column: 4, scope: !206)
!377 = !DILocation(line: 363, column: 4, scope: !207)
!378 = !DILocation(line: 378, column: 3, scope: !82)
!379 = !DILocation(line: 380, column: 1, scope: !82)
!380 = distinct !DISubprogram(name: "make_challenge_header", scope: !3, file: !3, line: 111, type: !381, scopeLine: 112, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !383)
!381 = !DISubroutineType(types: !382)
!382 = !{!163, !154}
!383 = !{!384, !385, !390, !391, !406, !407, !408, !409, !410, !411, !412, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !441}
!384 = !DILocalVariable(name: "payload", arg: 1, scope: !380, file: !3, line: 111, type: !154)
!385 = !DILocalVariable(name: "____fmt", scope: !386, file: !3, line: 113, type: !387)
!386 = distinct !DILexicalBlock(scope: !380, file: !3, line: 113, column: 2)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 368, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 46)
!390 = !DILocalVariable(name: "id", scope: !380, file: !3, line: 115, type: !163)
!391 = !DILocalVariable(name: "rec", scope: !380, file: !3, line: 117, type: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crPair", file: !394, line: 13, size: 640, elements: !395)
!394 = !DIFile(filename: "./common_kern_user.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_256", checksumkind: CSK_MD5, checksum: "ccc3620a97e58e3ebafe1a8241e2b384")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ch1", scope: !393, file: !394, line: 14, baseType: !163, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "resp11", scope: !393, file: !394, line: 15, baseType: !167, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "resp12", scope: !393, file: !394, line: 16, baseType: !167, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "resp13", scope: !393, file: !394, line: 17, baseType: !167, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "resp14", scope: !393, file: !394, line: 18, baseType: !167, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ch2", scope: !393, file: !394, line: 19, baseType: !163, size: 32, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "resp21", scope: !393, file: !394, line: 20, baseType: !167, size: 64, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "resp22", scope: !393, file: !394, line: 21, baseType: !167, size: 64, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "resp23", scope: !393, file: !394, line: 22, baseType: !167, size: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "resp24", scope: !393, file: !394, line: 23, baseType: !167, size: 64, offset: 576)
!406 = !DILocalVariable(name: "RN", scope: !380, file: !3, line: 119, type: !167)
!407 = !DILocalVariable(name: "RN1", scope: !380, file: !3, line: 120, type: !167)
!408 = !DILocalVariable(name: "RN2", scope: !380, file: !3, line: 121, type: !167)
!409 = !DILocalVariable(name: "RN3", scope: !380, file: !3, line: 122, type: !167)
!410 = !DILocalVariable(name: "i", scope: !380, file: !3, line: 124, type: !20)
!411 = !DILocalVariable(name: "key", scope: !380, file: !3, line: 126, type: !20)
!412 = !DILocalVariable(name: "____fmt", scope: !413, file: !3, line: 132, type: !416)
!413 = distinct !DILexicalBlock(scope: !414, file: !3, line: 132, column: 10)
!414 = distinct !DILexicalBlock(scope: !415, file: !3, line: 131, column: 9)
!415 = distinct !DILexicalBlock(scope: !380, file: !3, line: 130, column: 13)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 168, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 21)
!419 = !DILocalVariable(name: "c1", scope: !380, file: !3, line: 136, type: !163)
!420 = !DILocalVariable(name: "c2", scope: !380, file: !3, line: 137, type: !163)
!421 = !DILocalVariable(name: "r11", scope: !380, file: !3, line: 138, type: !167)
!422 = !DILocalVariable(name: "r12", scope: !380, file: !3, line: 139, type: !167)
!423 = !DILocalVariable(name: "r13", scope: !380, file: !3, line: 140, type: !167)
!424 = !DILocalVariable(name: "r14", scope: !380, file: !3, line: 141, type: !167)
!425 = !DILocalVariable(name: "r21", scope: !380, file: !3, line: 142, type: !167)
!426 = !DILocalVariable(name: "r22", scope: !380, file: !3, line: 143, type: !167)
!427 = !DILocalVariable(name: "r23", scope: !380, file: !3, line: 144, type: !167)
!428 = !DILocalVariable(name: "r24", scope: !380, file: !3, line: 145, type: !167)
!429 = !DILocalVariable(name: "temp1", scope: !380, file: !3, line: 147, type: !167)
!430 = !DILocalVariable(name: "temp2", scope: !380, file: !3, line: 148, type: !167)
!431 = !DILocalVariable(name: "temp3", scope: !380, file: !3, line: 149, type: !167)
!432 = !DILocalVariable(name: "temp4", scope: !380, file: !3, line: 150, type: !167)
!433 = !DILocalVariable(name: "result1", scope: !380, file: !3, line: 151, type: !167)
!434 = !DILocalVariable(name: "result2", scope: !380, file: !3, line: 152, type: !167)
!435 = !DILocalVariable(name: "result3", scope: !380, file: !3, line: 153, type: !167)
!436 = !DILocalVariable(name: "result4", scope: !380, file: !3, line: 154, type: !167)
!437 = !DILocalVariable(name: "input_ints", scope: !380, file: !3, line: 169, type: !438)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 768, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 12)
!441 = !DILocalVariable(name: "hash", scope: !380, file: !3, line: 185, type: !163)
!442 = !DILocation(line: 85, column: 5, scope: !443, inlinedAt: !470)
!443 = distinct !DISubprogram(name: "computeHash", scope: !3, file: !3, line: 75, type: !444, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !447)
!444 = !DISubroutineType(types: !445)
!445 = !{!20, !446, !20}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!447 = !{!448, !449, !450, !452, !456, !458, !459, !461, !464, !466}
!448 = !DILocalVariable(name: "input_ints", arg: 1, scope: !443, file: !3, line: 75, type: !446)
!449 = !DILocalVariable(name: "num_ints", arg: 2, scope: !443, file: !3, line: 75, type: !20)
!450 = !DILocalVariable(name: "__vla_expr0", scope: !443, type: !451, flags: DIFlagArtificial)
!451 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!452 = !DILocalVariable(name: "buffer", scope: !443, file: !3, line: 85, type: !453)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: !450)
