; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.auth_hdr = type <{ i8, i32, i32, i64, i64, i32, i32, i64 }>

@cr_db_map = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 48, i32 250000, i32 0 }, section "maps", align 4, !dbg !0
@hashValues = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 500, i32 0 }, section "maps", align 4, !dbg !27
@crc32_table = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 256, i32 0 }, section "maps", align 4, !dbg !37
@__const.xdp_parsing.____fmt = private unnamed_addr constant [17 x i8] c"hash value - %d \00", align 1
@__const.xdp_parsing.____fmt.1 = private unnamed_addr constant [30 x i8] c"Unavibale map for hash values\00", align 1
@__const.xdp_parsing.____fmt.2 = private unnamed_addr constant [48 x i8] c"Unmatching Hash Values. Authentication Failure\0A\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !39
@__const.make_challenge_header.____fmt = private unnamed_addr constant [46 x i8] c"Msg type is 0, this is a auth request message\00", align 1
@__const.computeHash.____fmt = private unnamed_addr constant [21 x i8] c"No such key exist!!\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cr_db_map", scope: !2, file: !3, line: 49, type: !29, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_128", checksumkind: CSK_MD5, checksum: "889e799a07462cdbd7eb298637581bbe")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_128", checksumkind: CSK_MD5, checksum: "db1ce4e5e29770657167bc8f57af9388")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !{!15, !16, !17, !20, !21, !23, !24, !19}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !18, line: 24, baseType: !19)
!18 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!19 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !18, line: 27, baseType: !7)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !37, !39, !44, !52, !57, !65, !72}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "hashValues", scope: !2, file: !3, line: 56, type: !29, isLocal: false, isDefinition: true)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !30, line: 33, size: 160, elements: !31)
!30 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_128", checksumkind: CSK_MD5, checksum: "9e37b5f46a8fb7f5ed35ab69309bf15d")
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !29, file: !30, line: 34, baseType: !7, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !29, file: !30, line: 35, baseType: !7, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !29, file: !30, line: 36, baseType: !7, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !29, file: !30, line: 37, baseType: !7, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !29, file: !30, line: 38, baseType: !7, size: 32, offset: 128)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "crc32_table", scope: !2, file: !3, line: 65, type: !29, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 360, type: !41, isLocal: false, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 4)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !46, line: 89, type: !47, isLocal: true, isDefinition: true)
!46 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_128", checksumkind: CSK_MD5, checksum: "2601bcf9d7985cb46bfbd904b60f5aaf")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !18, line: 31, baseType: !51)
!51 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "bpf_get_prandom_u32", scope: !2, file: !46, line: 168, type: !54, isLocal: true, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!20}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !46, line: 152, type: !59, isLocal: true, isDefinition: true)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !63, !20, null}
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !46, line: 55, type: !67, isLocal: true, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!62, !15, !70, !70, !50}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !46, line: 33, type: !74, isLocal: true, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!15, !15, !70}
!77 = !{i32 7, !"Dwarf Version", i32 5}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 1, !"wchar_size", i32 4}
!80 = !{i32 7, !"frame-pointer", i32 2}
!81 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!82 = distinct !DISubprogram(name: "xdp_parsing", scope: !3, file: !3, line: 206, type: !83, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !93)
!83 = !DISubroutineType(types: !84)
!84 = !{!62, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !87)
!87 = !{!88, !89, !90, !91, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !6, line: 2857, baseType: !20, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !86, file: !6, line: 2858, baseType: !20, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !86, file: !6, line: 2859, baseType: !20, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !86, file: !6, line: 2861, baseType: !20, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !86, file: !6, line: 2862, baseType: !20, size: 32, offset: 128)
!93 = !{!94, !95, !108, !138, !147, !148, !149, !173, !174, !175, !178, !179, !184, !185, !186, !189, !190, !192, !199, !202, !203}
!94 = !DILocalVariable(name: "ctx", arg: 1, scope: !82, file: !3, line: 206, type: !85)
!95 = !DILocalVariable(name: "eth", scope: !82, file: !3, line: 209, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !98, line: 168, size: 112, elements: !99)
!98 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!99 = !{!100, !104, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !97, file: !98, line: 169, baseType: !101, size: 48)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 48, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 6)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !97, file: !98, line: 170, baseType: !101, size: 48, offset: 48)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !97, file: !98, line: 171, baseType: !106, size: 16, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !107, line: 25, baseType: !17)
!107 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!108 = !DILocalVariable(name: "iph", scope: !82, file: !3, line: 210, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !111, line: 86, size: 160, elements: !112)
!111 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "4e88ed297bc3832dfa96a5c9b60cec92")
!112 = !{!113, !115, !116, !117, !118, !119, !120, !121, !122, !124}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !110, file: !111, line: 88, baseType: !114, size: 4, flags: DIFlagBitField, extraData: i64 0)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !18, line: 21, baseType: !25)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !110, file: !111, line: 89, baseType: !114, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !110, file: !111, line: 96, baseType: !114, size: 8, offset: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !110, file: !111, line: 97, baseType: !106, size: 16, offset: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !111, line: 98, baseType: !106, size: 16, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !110, file: !111, line: 99, baseType: !106, size: 16, offset: 48)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !110, file: !111, line: 100, baseType: !114, size: 8, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !110, file: !111, line: 101, baseType: !114, size: 8, offset: 72)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !110, file: !111, line: 102, baseType: !123, size: 16, offset: 80)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !107, line: 31, baseType: !17)
!124 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !111, line: 103, baseType: !125, size: 64, offset: 96)
!125 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !111, line: 103, size: 64, elements: !126)
!126 = !{!127, !133}
!127 = !DIDerivedType(tag: DW_TAG_member, scope: !125, file: !111, line: 103, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !125, file: !111, line: 103, size: 64, elements: !129)
!129 = !{!130, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !128, file: !111, line: 103, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !107, line: 27, baseType: !20)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !128, file: !111, line: 103, baseType: !131, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !125, file: !111, line: 103, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !125, file: !111, line: 103, size: 64, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !134, file: !111, line: 103, baseType: !131, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !134, file: !111, line: 103, baseType: !131, size: 32, offset: 32)
!138 = !DILocalVariable(name: "udph", scope: !82, file: !3, line: 211, type: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !141, line: 23, size: 64, elements: !142)
!141 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!142 = !{!143, !144, !145, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !140, file: !141, line: 24, baseType: !106, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !140, file: !141, line: 25, baseType: !106, size: 16, offset: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !141, line: 26, baseType: !106, size: 16, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !140, file: !141, line: 27, baseType: !123, size: 16, offset: 48)
!147 = !DILocalVariable(name: "data_end", scope: !82, file: !3, line: 213, type: !15)
!148 = !DILocalVariable(name: "data", scope: !82, file: !3, line: 214, type: !15)
!149 = !DILocalVariable(name: "payload", scope: !150, file: !3, line: 243, type: !154)
!150 = distinct !DILexicalBlock(scope: !151, file: !3, line: 236, column: 9)
!151 = distinct !DILexicalBlock(scope: !152, file: !3, line: 231, column: 13)
!152 = distinct !DILexicalBlock(scope: !153, file: !3, line: 217, column: 3)
!153 = distinct !DILexicalBlock(scope: !82, file: !3, line: 216, column: 6)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "auth_hdr", file: !3, line: 36, size: 328, elements: !156)
!156 = !{!157, !162, !165, !166, !169, !170, !171, !172}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "msgType", scope: !155, file: !3, line: 37, baseType: !158, size: 8)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !159, line: 24, baseType: !160)
!159 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !161, line: 38, baseType: !25)
!161 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "challenge1", scope: !155, file: !3, line: 38, baseType: !163, size: 32, offset: 8)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !159, line: 26, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !161, line: 42, baseType: !7)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "challenge2", scope: !155, file: !3, line: 39, baseType: !163, size: 32, offset: 40)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "randomnumber1", scope: !155, file: !3, line: 40, baseType: !167, size: 64, offset: 72)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !159, line: 27, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !161, line: 48, baseType: !51)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "randomnumber2", scope: !155, file: !3, line: 41, baseType: !167, size: 64, offset: 136)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !155, file: !3, line: 42, baseType: !163, size: 32, offset: 200)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !155, file: !3, line: 43, baseType: !163, size: 32, offset: 232)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prTime", scope: !155, file: !3, line: 44, baseType: !167, size: 64, offset: 264)
!173 = !DILocalVariable(name: "msg_type", scope: !150, file: !3, line: 255, type: !158)
!174 = !DILocalVariable(name: "id", scope: !150, file: !3, line: 256, type: !163)
!175 = !DILocalVariable(name: "t1", scope: !176, file: !3, line: 262, type: !167)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 261, column: 12)
!177 = distinct !DILexicalBlock(scope: !150, file: !3, line: 260, column: 15)
!178 = !DILocalVariable(name: "h", scope: !176, file: !3, line: 263, type: !163)
!179 = !DILocalVariable(name: "____fmt", scope: !180, file: !3, line: 264, type: !181)
!180 = distinct !DILexicalBlock(scope: !176, file: !3, line: 264, column: 13)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 136, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 17)
!184 = !DILocalVariable(name: "src_port", scope: !176, file: !3, line: 279, type: !106)
!185 = !DILocalVariable(name: "t2", scope: !176, file: !3, line: 292, type: !167)
!186 = !DILocalVariable(name: "t1", scope: !187, file: !3, line: 301, type: !167)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 300, column: 12)
!188 = distinct !DILexicalBlock(scope: !177, file: !3, line: 299, column: 20)
!189 = !DILocalVariable(name: "h1", scope: !187, file: !3, line: 302, type: !163)
!190 = !DILocalVariable(name: "h2", scope: !187, file: !3, line: 303, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!192 = !DILocalVariable(name: "____fmt", scope: !193, file: !3, line: 307, type: !196)
!193 = distinct !DILexicalBlock(scope: !194, file: !3, line: 307, column: 14)
!194 = distinct !DILexicalBlock(scope: !195, file: !3, line: 306, column: 13)
!195 = distinct !DILexicalBlock(scope: !187, file: !3, line: 305, column: 16)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 240, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 30)
!199 = !DILocalVariable(name: "src_port", scope: !200, file: !3, line: 324, type: !106)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 313, column: 13)
!201 = distinct !DILexicalBlock(scope: !187, file: !3, line: 312, column: 16)
!202 = !DILocalVariable(name: "t2", scope: !200, file: !3, line: 336, type: !167)
!203 = !DILocalVariable(name: "____fmt", scope: !204, file: !3, line: 342, type: !206)
!204 = distinct !DILexicalBlock(scope: !205, file: !3, line: 342, column: 4)
!205 = distinct !DILexicalBlock(scope: !201, file: !3, line: 341, column: 3)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 384, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 48)
!209 = !DILocation(line: 0, scope: !82)
!210 = !DILocation(line: 213, column: 44, scope: !82)
!211 = !{!212, !213, i64 4}
!212 = !{!"xdp_md", !213, i64 0, !213, i64 4, !213, i64 8, !213, i64 12, !213, i64 16}
!213 = !{!"int", !214, i64 0}
!214 = !{!"omnipotent char", !215, i64 0}
!215 = !{!"Simple C/C++ TBAA"}
!216 = !DILocation(line: 213, column: 30, scope: !82)
!217 = !DILocation(line: 213, column: 21, scope: !82)
!218 = !DILocation(line: 214, column: 40, scope: !82)
!219 = !{!212, !213, i64 0}
!220 = !DILocation(line: 214, column: 26, scope: !82)
!221 = !DILocation(line: 214, column: 17, scope: !82)
!222 = !DILocation(line: 216, column: 11, scope: !153)
!223 = !DILocation(line: 216, column: 6, scope: !82)
!224 = !DILocation(line: 218, column: 15, scope: !152)
!225 = !DILocation(line: 219, column: 18, scope: !226)
!226 = distinct !DILexicalBlock(scope: !152, file: !3, line: 219, column: 13)
!227 = !DILocation(line: 219, column: 33, scope: !226)
!228 = !DILocation(line: 219, column: 13, scope: !152)
!229 = !DILocation(line: 222, column: 13, scope: !230)
!230 = distinct !DILexicalBlock(scope: !152, file: !3, line: 222, column: 13)
!231 = !{!232, !233, i64 12}
!232 = !{!"ethhdr", !214, i64 0, !214, i64 6, !233, i64 12}
!233 = !{!"short", !214, i64 0}
!234 = !DILocation(line: 222, column: 37, scope: !230)
!235 = !DILocation(line: 222, column: 13, scope: !152)
!236 = !DILocation(line: 228, column: 33, scope: !237)
!237 = distinct !DILexicalBlock(scope: !152, file: !3, line: 228, column: 13)
!238 = !DILocation(line: 228, column: 48, scope: !237)
!239 = !DILocation(line: 228, column: 13, scope: !152)
!240 = !DILocation(line: 231, column: 18, scope: !151)
!241 = !{!242, !214, i64 9}
!242 = !{!"iphdr", !214, i64 0, !214, i64 0, !214, i64 1, !233, i64 2, !233, i64 4, !233, i64 6, !214, i64 8, !214, i64 9, !233, i64 10, !214, i64 12}
!243 = !DILocation(line: 231, column: 27, scope: !151)
!244 = !DILocation(line: 231, column: 13, scope: !152)
!245 = !DILocation(line: 238, column: 51, scope: !246)
!246 = distinct !DILexicalBlock(scope: !150, file: !3, line: 238, column: 16)
!247 = !DILocation(line: 238, column: 67, scope: !246)
!248 = !DILocation(line: 238, column: 16, scope: !150)
!249 = !DILocation(line: 243, column: 39, scope: !150)
!250 = !DILocation(line: 0, scope: !150)
!251 = !DILocation(line: 245, column: 59, scope: !252)
!252 = distinct !DILexicalBlock(scope: !150, file: !3, line: 245, column: 8)
!253 = !DILocation(line: 245, column: 77, scope: !252)
!254 = !DILocation(line: 245, column: 8, scope: !150)
!255 = !DILocation(line: 255, column: 40, scope: !150)
!256 = !{!257, !214, i64 0}
!257 = !{!"auth_hdr", !214, i64 0, !213, i64 1, !213, i64 5, !258, i64 9, !258, i64 17, !213, i64 25, !213, i64 29, !258, i64 33}
!258 = !{!"long long", !214, i64 0}
!259 = !DILocation(line: 256, column: 12, scope: !150)
!260 = !DILocation(line: 256, column: 26, scope: !150)
!261 = !{!257, !213, i64 29}
!262 = !DILocation(line: 256, column: 56, scope: !150)
!263 = !DILocation(line: 256, column: 21, scope: !150)
!264 = !{!213, !213, i64 0}
!265 = !DILocation(line: 260, column: 15, scope: !150)
!266 = !DILocation(line: 262, column: 17, scope: !176)
!267 = !DILocation(line: 0, scope: !176)
!268 = !DILocation(line: 263, column: 13, scope: !176)
!269 = !DILocation(line: 263, column: 26, scope: !176)
!270 = !DILocation(line: 263, column: 22, scope: !176)
!271 = !DILocation(line: 264, column: 13, scope: !180)
!272 = !DILocation(line: 264, column: 13, scope: !176)
!273 = !DILocation(line: 265, column: 8, scope: !274)
!274 = distinct !DILexicalBlock(scope: !176, file: !3, line: 265, column: 6)
!275 = !DILocation(line: 265, column: 6, scope: !176)
!276 = !DILocation(line: 269, column: 14, scope: !277)
!277 = distinct !DILexicalBlock(scope: !274, file: !3, line: 268, column: 13)
!278 = !DILocalVariable(name: "iphdr", arg: 1, scope: !279, file: !280, line: 136, type: !109)
!279 = distinct !DISubprogram(name: "swap_src_dst_ipv4", scope: !280, file: !280, line: 136, type: !281, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !283)
!280 = !DIFile(filename: "./../common/rewrite_helpers.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_128", checksumkind: CSK_MD5, checksum: "75040841dc53cbf2ffc17c0802a4440a")
!281 = !DISubroutineType(types: !282)
!282 = !{null, !109}
!283 = !{!278, !284}
!284 = !DILocalVariable(name: "tmp", scope: !279, file: !280, line: 138, type: !131)
!285 = !DILocation(line: 0, scope: !279, inlinedAt: !286)
!286 = distinct !DILocation(line: 275, column: 7, scope: !176)
!287 = !DILocation(line: 138, column: 22, scope: !279, inlinedAt: !286)
!288 = !{!214, !214, i64 0}
!289 = !DILocation(line: 140, column: 24, scope: !279, inlinedAt: !286)
!290 = !DILocation(line: 140, column: 15, scope: !279, inlinedAt: !286)
!291 = !DILocation(line: 141, column: 15, scope: !279, inlinedAt: !286)
!292 = !DILocalVariable(name: "eth", arg: 1, scope: !293, file: !280, line: 113, type: !96)
!293 = distinct !DISubprogram(name: "swap_src_dst_mac", scope: !280, file: !280, line: 113, type: !294, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !296)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !96}
!296 = !{!292, !297}
!297 = !DILocalVariable(name: "h_tmp", scope: !293, file: !280, line: 115, type: !298)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 48, elements: !102)
!299 = !DILocation(line: 0, scope: !293, inlinedAt: !300)
!300 = distinct !DILocation(line: 277, column: 7, scope: !176)
!301 = !DILocation(line: 115, column: 2, scope: !293, inlinedAt: !300)
!302 = !DILocation(line: 115, column: 7, scope: !293, inlinedAt: !300)
!303 = !DILocation(line: 117, column: 2, scope: !293, inlinedAt: !300)
!304 = !DILocation(line: 118, column: 2, scope: !293, inlinedAt: !300)
!305 = !DILocation(line: 119, column: 2, scope: !293, inlinedAt: !300)
!306 = !DILocation(line: 120, column: 1, scope: !293, inlinedAt: !300)
!307 = !DILocation(line: 279, column: 31, scope: !176)
!308 = !{!309, !233, i64 0}
!309 = !{!"udphdr", !233, i64 0, !233, i64 2, !233, i64 4, !233, i64 6}
!310 = !DILocation(line: 280, column: 28, scope: !176)
!311 = !{!309, !233, i64 2}
!312 = !DILocation(line: 280, column: 20, scope: !176)
!313 = !DILocation(line: 281, column: 18, scope: !176)
!314 = !DILocation(line: 286, column: 13, scope: !176)
!315 = !DILocation(line: 286, column: 19, scope: !176)
!316 = !{!309, !233, i64 6}
!317 = !DILocation(line: 289, column: 12, scope: !176)
!318 = !DILocation(line: 289, column: 18, scope: !176)
!319 = !{!242, !233, i64 10}
!320 = !DILocation(line: 290, column: 20, scope: !176)
!321 = !DILocation(line: 290, column: 18, scope: !176)
!322 = !DILocation(line: 292, column: 17, scope: !176)
!323 = !DILocation(line: 294, column: 20, scope: !176)
!324 = !DILocation(line: 294, column: 12, scope: !176)
!325 = !DILocation(line: 294, column: 18, scope: !176)
!326 = !{!257, !258, i64 33}
!327 = !DILocation(line: 297, column: 12, scope: !177)
!328 = !DILocation(line: 301, column: 17, scope: !187)
!329 = !DILocation(line: 0, scope: !187)
!330 = !DILocation(line: 302, column: 27, scope: !187)
!331 = !{!257, !213, i64 25}
!332 = !DILocation(line: 303, column: 28, scope: !187)
!333 = !DILocation(line: 305, column: 17, scope: !195)
!334 = !DILocation(line: 305, column: 16, scope: !187)
!335 = !DILocation(line: 307, column: 14, scope: !193)
!336 = !DILocation(line: 307, column: 14, scope: !194)
!337 = !DILocation(line: 308, column: 14, scope: !194)
!338 = !DILocation(line: 312, column: 22, scope: !201)
!339 = !DILocation(line: 312, column: 19, scope: !201)
!340 = !DILocation(line: 312, column: 16, scope: !187)
!341 = !DILocation(line: 314, column: 31, scope: !200)
!342 = !DILocation(line: 315, column: 36, scope: !200)
!343 = !DILocation(line: 315, column: 34, scope: !200)
!344 = !DILocation(line: 0, scope: !279, inlinedAt: !345)
!345 = distinct !DILocation(line: 320, column: 8, scope: !200)
!346 = !DILocation(line: 138, column: 22, scope: !279, inlinedAt: !345)
!347 = !DILocation(line: 140, column: 24, scope: !279, inlinedAt: !345)
!348 = !DILocation(line: 140, column: 15, scope: !279, inlinedAt: !345)
!349 = !DILocation(line: 141, column: 15, scope: !279, inlinedAt: !345)
!350 = !DILocation(line: 0, scope: !293, inlinedAt: !351)
!351 = distinct !DILocation(line: 322, column: 8, scope: !200)
!352 = !DILocation(line: 115, column: 2, scope: !293, inlinedAt: !351)
!353 = !DILocation(line: 115, column: 7, scope: !293, inlinedAt: !351)
!354 = !DILocation(line: 117, column: 2, scope: !293, inlinedAt: !351)
!355 = !DILocation(line: 118, column: 2, scope: !293, inlinedAt: !351)
!356 = !DILocation(line: 119, column: 2, scope: !293, inlinedAt: !351)
!357 = !DILocation(line: 120, column: 1, scope: !293, inlinedAt: !351)
!358 = !DILocation(line: 324, column: 32, scope: !200)
!359 = !DILocation(line: 0, scope: !200)
!360 = !DILocation(line: 325, column: 29, scope: !200)
!361 = !DILocation(line: 325, column: 21, scope: !200)
!362 = !DILocation(line: 326, column: 19, scope: !200)
!363 = !DILocation(line: 330, column: 14, scope: !200)
!364 = !DILocation(line: 330, column: 20, scope: !200)
!365 = !DILocation(line: 333, column: 13, scope: !200)
!366 = !DILocation(line: 333, column: 19, scope: !200)
!367 = !DILocation(line: 334, column: 21, scope: !200)
!368 = !DILocation(line: 334, column: 19, scope: !200)
!369 = !DILocation(line: 336, column: 18, scope: !200)
!370 = !DILocation(line: 337, column: 21, scope: !200)
!371 = !DILocation(line: 337, column: 13, scope: !200)
!372 = !DILocation(line: 337, column: 19, scope: !200)
!373 = !DILocation(line: 348, column: 9, scope: !151)
!374 = !DILocation(line: 342, column: 4, scope: !204)
!375 = !DILocation(line: 342, column: 4, scope: !205)
!376 = !DILocation(line: 357, column: 3, scope: !82)
!377 = !DILocation(line: 359, column: 1, scope: !82)
!378 = distinct !DISubprogram(name: "make_challenge_header", scope: !3, file: !3, line: 109, type: !379, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !381)
!379 = !DISubroutineType(types: !380)
!380 = !{!163, !154}
!381 = !{!382, !383, !388, !389, !400, !401, !402, !403, !404, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !423}
!382 = !DILocalVariable(name: "payload", arg: 1, scope: !378, file: !3, line: 109, type: !154)
!383 = !DILocalVariable(name: "____fmt", scope: !384, file: !3, line: 111, type: !385)
!384 = distinct !DILexicalBlock(scope: !378, file: !3, line: 111, column: 2)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 368, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 46)
!388 = !DILocalVariable(name: "id", scope: !378, file: !3, line: 113, type: !163)
!389 = !DILocalVariable(name: "rec", scope: !378, file: !3, line: 115, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crPair", file: !392, line: 13, size: 384, elements: !393)
!392 = !DIFile(filename: "./common_kern_user.h", directory: "/home/netx3/xdp_experiments/xdp-tutorial/final_code_128", checksumkind: CSK_MD5, checksum: "4dd0c7a3bafa12f70d19123188a13578")
!393 = !{!394, !395, !396, !397, !398, !399}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ch1", scope: !391, file: !392, line: 14, baseType: !163, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "resp11", scope: !391, file: !392, line: 15, baseType: !167, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "resp12", scope: !391, file: !392, line: 16, baseType: !167, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ch2", scope: !391, file: !392, line: 17, baseType: !163, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "resp21", scope: !391, file: !392, line: 18, baseType: !167, size: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "resp22", scope: !391, file: !392, line: 19, baseType: !167, size: 64, offset: 320)
!400 = !DILocalVariable(name: "RN", scope: !378, file: !3, line: 117, type: !167)
!401 = !DILocalVariable(name: "RN1", scope: !378, file: !3, line: 118, type: !167)
!402 = !DILocalVariable(name: "i", scope: !378, file: !3, line: 120, type: !20)
!403 = !DILocalVariable(name: "key", scope: !378, file: !3, line: 122, type: !20)
!404 = !DILocalVariable(name: "____fmt", scope: !405, file: !3, line: 128, type: !408)
!405 = distinct !DILexicalBlock(scope: !406, file: !3, line: 128, column: 10)
!406 = distinct !DILexicalBlock(scope: !407, file: !3, line: 127, column: 9)
!407 = distinct !DILexicalBlock(scope: !378, file: !3, line: 126, column: 13)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 168, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 21)
!411 = !DILocalVariable(name: "c1", scope: !378, file: !3, line: 132, type: !163)
!412 = !DILocalVariable(name: "c2", scope: !378, file: !3, line: 133, type: !163)
!413 = !DILocalVariable(name: "r11", scope: !378, file: !3, line: 134, type: !167)
!414 = !DILocalVariable(name: "r12", scope: !378, file: !3, line: 135, type: !167)
!415 = !DILocalVariable(name: "r21", scope: !378, file: !3, line: 136, type: !167)
!416 = !DILocalVariable(name: "r22", scope: !378, file: !3, line: 137, type: !167)
!417 = !DILocalVariable(name: "temp1", scope: !378, file: !3, line: 139, type: !167)
!418 = !DILocalVariable(name: "temp2", scope: !378, file: !3, line: 140, type: !167)
!419 = !DILocalVariable(name: "result1", scope: !378, file: !3, line: 141, type: !167)
!420 = !DILocalVariable(name: "result2", scope: !378, file: !3, line: 142, type: !167)
!421 = !DILocalVariable(name: "input_ints", scope: !378, file: !3, line: 155, type: !422)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 384, elements: !102)
!423 = !DILocalVariable(name: "hash", scope: !378, file: !3, line: 165, type: !163)
!424 = !DILocation(line: 83, column: 5, scope: !425, inlinedAt: !452)
!425 = distinct !DISubprogram(name: "computeHash", scope: !3, file: !3, line: 73, type: !426, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !429)
!426 = !DISubroutineType(types: !427)
!427 = !{!20, !428, !20}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!429 = !{!430, !431, !432, !434, !438, !440, !441, !443, !446, !448}
!430 = !DILocalVariable(name: "input_ints", arg: 1, scope: !425, file: !3, line: 73, type: !428)
!431 = !DILocalVariable(name: "num_ints", arg: 2, scope: !425, file: !3, line: 73, type: !20)
!432 = !DILocalVariable(name: "__vla_expr0", scope: !425, type: !433, flags: DIFlagArtificial)
!433 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!434 = !DILocalVariable(name: "buffer", scope: !425, file: !3, line: 83, type: !435)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: !432)
!438 = !DILocalVariable(name: "i", scope: !439, file: !3, line: 84, type: !20)
!439 = distinct !DILexicalBlock(scope: !425, file: !3, line: 84, column: 5)
!440 = !DILocalVariable(name: "crc", scope: !425, file: !3, line: 89, type: !20)
!441 = !DILocalVariable(name: "i", scope: !442, file: !3, line: 90, type: !20)
!442 = distinct !DILexicalBlock(scope: !425, file: !3, line: 90, column: 5)
!443 = !DILocalVariable(name: "index", scope: !444, file: !3, line: 92, type: !20)
!444 = distinct !DILexicalBlock(scope: !445, file: !3, line: 90, column: 48)
!445 = distinct !DILexicalBlock(scope: !442, file: !3, line: 90, column: 5)
!446 = !DILocalVariable(name: "rec", scope: !444, file: !3, line: 93, type: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!448 = !DILocalVariable(name: "____fmt", scope: !449, file: !3, line: 97, type: !408)
